In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('remove_unwanted_chars.xlsx')

In [3]:
df

      Name               Project   Salary
0   Dighan  Proj#ect Manage(ment  67~0990
1    Osei*         Improvement#$   67^009
2  Richar@            Analyti&cs    90(00
3    Oma#r            Makreting$    ^7990
4    R$ico                  Chef     8999

In [5]:
for column in df.columns:
    df[column] = df[column].str.replace(r'\W',"")
df

     Name            Project  Salary
0  Dighan  ProjectManagement  670990
1    Osei        Improvement   67009
2  Richar          Analytics    9000
3    Omar          Makreting    7990
4    Rico               Chef     NaN

In [ ]:
r-regular exp
''-denote string
\-start regex
W- inverse of all letters and numbers
# df[column] = df[column].str.replace(r'\W',"")